<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"27ef8d861a1a19dea2c1a64702a386cb35ea68a4bacabbb7366ad16afdace24d","plan_job_ref":"Job Create terraform plan #1 at https://github.com/patrickeasters/mds-alerts-example/actions/runs/5397289404","plan_hash":"115da107112d1463a53021cb1e1cce392c99fe6a9b8d5d776b38a37c35c0e7f7","plan_text_format":"text","version":"1.36.0"} -->
Terraform plan in __./__
With variables: `sysdig_monitor_api_token = "58f58abe-72b1-4227-a040-ca0838ebaed3-c2EK"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.sysdig_primary.sysdig_monitor_alert_v2_prometheus.missing_group will be created
  + resource "sysdig_monitor_alert_v2_prometheus" "missing_group" {
      + description           = "scrape job uptime"
      + enabled               = true
      + group                 = "default"
      + id                    = (known after apply)
      + name                  = "probe up"
      + query                 = "min(up) < 1"
      + severity              = "medium"
      + team                  = (known after apply)
      + trigger_after_minutes = 10
      + version               = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Create terraform plan #1](https://github.com/patrickeasters/mds-alerts-example/actions/runs/5397289404)